//Асинхронність

//Синзронний код виконуєтся по порядку( не перезодить до наступного рядка поки не завершится поточний)
//Асинхронний код - setTimeout, fetch() асинзронні функціі(вони передают свою роботу у веб АПИ , і відбуваються пізніше)

// console.log("Початок");

// setTimeout(() => {
//   console.log("Це асинхронний код!");
// }, 2000);

// console.log("Кінець");
//=================ASYNc Функція======================================

// async function myFunction() {
//   return "✅ це `async` функція";
// }

// myFunction(); // async - ключове слово яке робить функція асинхронною

//==========================================
// async function fetchData() {
//   return fetch("https://jsonplaceholder.typicode.com/users/1");
// }

// console.log(fetchData());
//==========================================
// async function fetchData() {
//   let response = await fetch("https://jsonplaceholder.typicode.com/users/1");

//   let user = await response.json(); //метод json також відбуважтся асинхронно, бо щоб прочитати дані також потрібен якийсь час
//   console.log(user);
// }

// fetchData(); //це ассинзронна функція але завдаки ключовому слову await , все відьуважтся синхронно
//==========================================
//await - дає смогу працювати з асинзронним кодом так, ніби він синхронний
//==================Promise===============================
//Promice - 3 стани : успішний (resolved) : щось пішло не так (regected) : очікування (pending)
//==========================================
//Resolve
// const myPromise = new Promise((resolve, reject) => {
//   setTimeout(() => {
//     let success = true;

//     if (success) {
//       resolve("✅Дані отримано!");
//     } else {
//       reject("❌Помилка!");
//     }
//   }, 2000);
// });

// console.log("⏳Очікуємо...");

// myPromise
//   .then((result) => console.log(result)) // (Потім) - спрацьовує тільки тоді коли нам повернулось resolve
//   .catch((error) => console.error(error)) // відловлює помилку , спрацбовує тоді коли функція повертає reject
//   .finally(() => console.log("🟨 Завершено!")); //відбуваєтся в незалежності від того що в нас відбулось
//==========================================
//Pending (дефолтний стан promise) початковий
//==========================================
// fetch("https://jsonplaceholder.typicode.com/users/1")
//   .then((response) => response.json())
//   .then((user) => console.log("👤 Користувач:", user))
//   .catch((error) => console.error("❌ Помилка:", error));
//==========================================
//async await накращий спосіб для роботи з асинхронними функціями

//===================Event Loop=============================
//call stack - основний потік задач

//WEB API (браузенрні API) оброблює асинхронні функціі

//Task Queue (Черга завдань) список задач які були асинхронними які маю бути перекинуті знову в call stack

//Microtask Queue (черга мікрозадань) - має вищий приорітет

//Event Loop - це мезанізм який перевіряє call stack і якшо він пустий но перевіряє завдання в одній із двох черг

//===================Event Loop=============================
//Асонхронний код відбуважєтся завжди після синхронного!!!
// console.log("Початок"); //call stack

// setTimeout(() => {
//   console.log("Це асинзронний код!"); //спочатку попав у WEB API і після того як він виконанався він попадає в чергу завдань
// }, 2000);

// console.log("Кінець"); //call stack

//==========================================

// console.log("A");

// setTimeout(() => {
//   console.log("B");
// }, 0);

// console.log("C");
//==========================================
//мікро завдання має пріорітет

// console.log("A");

// setTimeout(() => console.log("B"), 0);

// Promise.resolve().then(() => console.log("C")); //microtask

// console.log("D");

//Call stack - зберігются всі синзронні операціі
//WEB API - зберігаются асинхронні операціі поки вони не виконаются
//==========================================
