//Функція-колбек - це функція, яка передається іншій функції як аргумент. Ця концепція є основою функцій вищого порядку, і вона дозволяє структурувати код та здійснювати динамічні виклики.
//Асинхронні функції-колбеки є потужним інструментом для управління асинхронним кодом та подіями. Вони використовуються для реалізації зворотного виклику, коли операція завершилася.

//Функції вищого порядку (higher-order functions) - це функції, які приймають одну або декілька інших функцій як аргументи і/або повертають функції як результат своєї роботи. Функції вищого порядку є потужним інструментом в функціональному програмуванні і в JavaScript загалом, оскільки вони дозволяють створювати більш абстрактний та зрозумілий код.
//Чисті функції є фундаментальним поняттям в програмуванні, особливо в JavaScript. Це функції, які мають певні властивості, спрощуючи розробку, розуміння і тестування коду.

//Використовуючи чисті функції, можна забезпечити більшу стабільність, легкість розуміння і підтримки коду, що робить їх важливою концепцією в розробці програмного забезпечення.

//______________________________________________________________________

//Стрілкові функціі

//______________________________________________________________________
